# 데이터 프레임
- 2차원 행렬 데이터에 인덱스를 붙인 것
- 행과 열로 만들어지는 2차원 배열 구조
- R의 데이터 프레임에서 유래
- 데이터프레임의 각 열은 시리즈로 구성되어 있음
- DataFrame()함수를 사용해서 생성

In [1]:
import numpy as np
import pandas as pd

## 데이터 프레임 생성

**리스트로 데이터 프레임 만들기**
- DataFrame[[list1], [list2]])
- 각 리스트는 한 행으로 구성됨
- 행의 원소 개수가 다르면 None 값으로 저장

In [10]:
# 2차원 리스트로 데이터프레임 생성
# df = pd.DataFrame([['a','a','a',],['b','a','a'],['c',9,np.nan]])
# df.transpose()

df = pd.DataFrame([['a','b','c',],['a','a',9],['a','a']]) # 첫번째 리스트는 첫번째 행이 된다.
df

   0  1     2
0  a  b     c
1  a  a     9
2  a  a  None

**딕셔너리로 데이터프레임 생성**
- dict의 key -> column

In [13]:
# 열방향 인덱스(문자) 행방향 인덱스(숫자)가 있는 데이터 프레임 생성
# 열 데이터를 dict 형태로 작성하는게 일반적

df1 = pd.DataFrame({'A':[90,80,70],
                   'B':[86,98,75],
                   'C':[88,99,77],
                   'D':[87,89,86]})
df1

    A   B   C   D
0  90  86  88  87
1  80  98  99  89
2  70  75  77  86

In [19]:
# 딕셔너리로 데이터 프레임 생성
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2000002],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율":[0.0283, 0.0163, 0.0982,0.0141]
}
data

# 열방향 인덱스 columns =
columns = ['지역' , '2015' , '2010' , '2005' , '2000' , '2010-2015 증가율']

# 행방향 인덱스 index = 
index = ['서울' , '부산' , '인천' , '대구']

#DataFrame(데이터, index =  , columns = )
df2 = pd.DataFrame(data, index = index , columns = columns)
df2

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2000002  2456016  2473990         0.0141

**시리즈로 데이터 프레임 생성**
- 각 Series의 인덱스 -> column

In [22]:
a = pd.Series([100,200,300] , ['a','b','d'])
b = pd.Series([101,201,301], ['a','b','k'])
c = pd.Series([110,210,310], ['a', 'b','c'])

pd.DataFrame([a,b,c] , index = [100,101,102])

         a      b      d      k      c
100  100.0  200.0  300.0    NaN    NaN
101  101.0  201.0    NaN  301.0    NaN
102  110.0  210.0    NaN    NaN  310.0

**csv 데이터로부터 DataFrame 생성**
- 데이터 분석을 위해, dataframe을 생성하는 가장 일반적인 방법
- 데이터 소스로부터 추출된 csv(comma separated values) 파일로부터 생성
- pandas.read_csv()함수 사용

In [26]:
trainData = pd.read_csv('C:/Users/hspar/Desktop/HS_Park/멀티캠퍼스/data/train.csv')
trainData.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**read_csv()함수 파라미터**
- sep : 각 데이터를 구별하기 위한 구분자로 사용
- header : header를 무시할 경우 , None 설정
- index_col : index로 사용할 column 설정
- usecols : 실제로 dataframe에 로딩할 columns만 설정

In [32]:
trainData = pd.read_csv('C:/Users/hspar/Desktop/HS_Park/멀티캠퍼스/data/train.csv',
                       index_col='PassengerId',
                       usecols=['PassengerId' , 'Survived' , 'Pclass' , 'Name'])
trainData

,Survived,Pclass,Name
PassengerId,,,
1,0,3,"Braund, Mr. Owen Harris"
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
3,1,3,"Heikkinen, Miss. Laina"
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
5,0,3,"Allen, Mr. William Henry"
...,...,...,...
887,0,2,"Montvila, Rev. Juozas"
888,1,1,"Graham, Miss. Margaret Edith"
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie"""
890,1,1,"Behr, Mr. Karl Howell"
891,0,3,"Dooley, Mr. Patrick"

In [34]:
# 데이터프레임 열인덱스
trainData.columns

Index(['Survived', 'Pclass', 'Name'], dtype='object')

In [36]:
trainData.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
           dtype='int64', name='PassengerId', length=891)

## 인덱스와 컬럼의 이해
1. 인덱스
- 인덱스 속성
- 각 아이템을 특정할 수 있는 고유의 값
- 복잡한 데이터의 경우...인덱스로 표현 가능

2. 컬럼
....

In [38]:
# 열방향 인덱스 출력
df2.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [40]:
# 행방향 인덱스 출력
df2.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

**행/열 인덱스 이름 설정**
- index.name
- columns.name

In [42]:
# 시리즈처럼 dataFrame에서도 각 방향 인덱스에 name 속성을 지정할 수 있음
df2.index.name='도시'
df2.columns.name = '특성'
df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2000002  2456016  2473990         0.0141

**데이터프레임의 값 접근 : values 속성**

In [43]:
df2.values
# 반환값은 array 형태

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2000002, 2456016, 2473990, 0.0141]], dtype=object)

**데이터프레임의 데이터 파악하기**
- shape 속성( row, column)
- describe()함수 : 숫자형 데이터의 통계치 계산
- info() 함수 : 데이터 타입, 각 아이템의 개수 등 출력

In [45]:
df2.info()
# 개요 출력

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 대구
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지역             4 non-null      object
 1   2015           4 non-null      int64
 2   2010           4 non-null      int64
 3   2005           4 non-null      int64
 4   2000           4 non-null      int64
 5   2010-2015 증가율  4 non-null      float64
dtypes: float64(1), int64(4), object(1)
memory usage: 396.0+ bytes

In [48]:
df2.describe()
# 통계적 개요 출력

특성             2015          2010          2005          2000  2010-2015 증가율
count  4.000000e+00  4.000000e+00  4.000000e+00  4.000000e+00       4.000000
mean   4.677388e+06  4.414178e+06  4.562197e+06  4.612434e+06       0.039225
std    3.507776e+06  3.524531e+06  3.500545e+06  3.538749e+06       0.039809
min    2.466052e+06  2.000002e+06  2.456016e+06  2.466338e+06       0.014100
25%    2.784351e+06  2.474027e+06  2.502264e+06  2.472077e+06       0.015750
50%    3.169594e+06  3.012613e+06  3.015114e+06  3.064714e+06       0.022300
75%    5.062631e+06  4.952764e+06  5.075047e+06  5.205071e+06       0.045775
max    9.904312e+06  9.631482e+06  9.762546e+06  9.853972e+06       0.098200

In [52]:
df2.shape
# 행,렬 개수 출력

(4, 6)

**데이터프레임 전치**
전치 : 행과 열을 바꾸는 기능

In [57]:
# df2 전치 : .T 속성
df2.transpose()
df2.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2000002
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

**데이터 프레임 내용 변경**

In [58]:
# 해당열이 있으면 내용 갱신 , 열이 없으면 추가

## 열추가 : df[열이름(key)]=values
## 열 내용 갱신 : df[열이름(key)]=values

In [60]:
# 열 내용 변경 : 증가율 변경
df2['2010-2015 증가율']=df2['2010-2015 증가율']*100

In [62]:
df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          283.0
부산  경상권  3448737  3393191  3512547  3655437          163.0
인천  수도권  2890451  2632035  2517680  2466338          982.0
대구  경상권  2466052  2000002  2456016  2473990          141.0

In [68]:
# 열추가
df2['2005-2015 증가율']= ((df2['2015']-df2['2005'])/df2['2005']*100).round(2)
df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          283.0           1.45
부산  경상권  3448737  3393191  3512547  3655437          163.0          -1.82
인천  수도권  2890451  2632035  2517680  2466338          982.0          14.81
대구  경상권  2466052  2000002  2456016  2473990          141.0           0.41

In [71]:
# 열 삭제 . del df[삭제열]
# del df2['2010-2015 증가율']
df2

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           1.45
부산  경상권  3448737  3393191  3512547  3655437          -1.82
인천  수도권  2890451  2632035  2517680  2466338          14.81
대구  경상권  2466052  2000002  2456016  2473990           0.41

**데이터 프레임 인덱싱**
1. 열인덱싱
- 열 라벨(컬럼명)을 키값으로 생각하고 인덱싱한다.
    - 인덱스로 라벨값을 하나 넣으면 시리즈 객체가 반환
    - 라벨의 배열이나 리스트를 넣으면 부분적 df가 반환

In [72]:
# 인덱스로 라벨값 1개 사용
df2['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [73]:
# 열 1개를 접근할때는 연산자 사용 가능 : df.컬럼명
df2.지역

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [74]:
# 지역 컬럼 데이터 유형 확인
type(df2.지역)

pandas.core.series.Series

In [76]:
# 열을 추출할 때 df로 반환받고자 하면 [] 를 사용 ->DataFrame으로 반환(type)
# 리스트로 인덱싱 : df로 반환

df2[['지역']]

특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [78]:
type(df2[['지역']])

pandas.core.frame.DataFrame

In [108]:
#여러개의 열을 추출
# [] 리스트 사용 : df 반환
df2[['2010','2015']]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2000002  2466052

In [110]:
df2['2010':'2015'] #인덱싱으로 하면 오류 발생 , 슬라이싱 해야함

KeyError: '2010'

**pandas 데이터 프레임에 열이름(컬럼명)이 문자열일 경우**
- 수치 인덱스를 사용할 수 없음
- 위치 인덱싱 기능을 사용할 수 없음 : keyerror 발생

In [83]:
try : 
    df2[0] # keyerror 발생
except Exception as e :
    print(type(e))

<class 'KeyError'>

In [85]:
df2[0]

KeyError: 0

위치 인덱싱처럼 보이는 예제

In [86]:
# 예제 df3 생성
# numpy의 arange 함수 이용해서 0-11 범위의 정수 생성 후
# reshape 함수 이용하여 3행 4열로 배치

In [91]:
df3 = pd.DataFrame(np.arange(12).reshape(3,4))
df3

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [92]:
# 위치 인덱싱이 아닌 컬럼명이 숫자로 되어 있는 df의 접근
df3[0] # 가능

0    0
1    4
2    8
Name: 0, dtype: int32

In [93]:
df3[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

**행 단위 인덱싱**
- 행 단위 인덱싱을 하고자 하면 슬라이싱을 함
- 인덱스 값이 문자면 문자 슬라이싱도 가능

In [94]:
# 예제 데이터프레임
df2

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           1.45
부산  경상권  3448737  3393191  3512547  3655437          -1.82
인천  수도권  2890451  2632035  2517680  2466338          14.81
대구  경상권  2466052  2000002  2456016  2473990           0.41

In [95]:
# 1행 추출 [:1]  슬라이싱 사용
df2[:1]

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           1.45

In [96]:
#1행 추출
df2[0:1]

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           1.45

In [97]:
# [시작값:끝값+1]
df2[1:3]

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437          -1.82
인천  수도권  2890451  2632035  2517680  2466338          14.81

In [99]:
# 행 인덱스 '서울'부터 '부산'까지 추출
df2['서울'] #열 이름으로만 찾기 때문에 에러 발생

KeyError: '서울'

In [100]:
df2['서울':'부산']

특성   지역     2015     2010     2005     2000  2005-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           1.45
부산  경상권  3448737  3393191  3512547  3655437          -1.82

개별요소 접근[열][행]

In [101]:
df2['2015']['서울']

9904312

In [103]:
# 원소값의 형태가 출력 - 정수
type(df2['2015']['서울'])

numpy.int64

- 데이터 프레임은 열기준으로 접근 원칙 : [열이름]
- 행기준 접근을 위해서는 슬라이싱을 적용 : [행이름:행이름]
- 행과열을 같이 적용(개별요소) :[열기준][행이름]

In [105]:
df2['2015']['서울':'부산']

도시
서울    9904312
부산    3448737
Name: 2015, dtype: int64

데이터 프레임 인덱서 : loc , iloc
- loc : 라벨값 기반의 2차원 인덱싱
- iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

In [107]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"
# 변수 명이 두번 이상 출력되어도 모두 콘솔에서 보여줄 것!!

pandas 패키지는 [행번호,열번호] 인덱싱 불가
iloc 속성 사용하면 가능

**loc인덱서(행 우선 인덱서)**
- df.loc[행인덱싱 값] # 행 우선 인덱서

In [118]:
# 예제 데이터프레임 생성
df = pd.DataFrame(np.arange(10,22).reshape(3,4),
                  index = 'a b c'.split(),
                  columns='A B C D'.split())
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [119]:
# loc 인덱서 : 인덱싱 값을 하나만 받는 경우
df.loc['a']

# 출력결과 : 시리즈로 반환

A    10
B    11
C    12
D    13
Name: a, dtype: int32

loc 인덱서에서는 열 단독 인덱싱은 불가능함

In [121]:
# df.loc['A']  #행 우선이기 때문에 불가능

In [123]:
# b행부터 c행의 모든 열 반환
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [126]:
df.loc[['b','c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [128]:
df.loc[['a','c']]

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [129]:
df.loc['a'] # 시리즈 형태로 출력

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [130]:
df.loc[['a']] #괄호를 하나 더 쓰면 df 형태로 출력

    A   B   C   D
a  10  11  12  13

In [131]:
# 컬럼명에 B,C가 존재
df[['B','C']]

    B   C
a  11  12
b  15  16
c  19  20

boolean selection을 행을 선택하는 인덱싱 값으로 쓸 수 있음

In [132]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

df의 A열의 값이 15보다 큰 행만 추출

In [133]:
df.A>15

a    False
b    False
c     True
Name: A, dtype: bool

In [134]:
df.loc[df.A>15]

    A   B   C   D
c  18  19  20  21

In [135]:
df[df.A>15]

    A   B   C   D
c  18  19  20  21

- 인덱스 대신 인덱스 값을 반환하는 함수 사용

In [137]:
# 함수 작성
def sel_row(df):
    return df.A>15

# True나 False가 반환

In [138]:
# 함수 호출 인덱싱
sel_row(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [139]:
df.loc[sel_row(df)]

    A   B   C   D
c  18  19  20  21

loc 인덱서 슬라이싱

In [143]:
# 예제 df 생성
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4), columns = 'a b c d'.split())
df2

    a   b   c   d
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [145]:
# 값 인덱싱 - 슬라이싱 초기값 : 끝값
df2.loc[1:2]

    a   b   c   d
1  14  15  16  17
2  18  19  20  21

In [146]:
# 위치 인덱싱 ==> 슬라이싱 초기 위치 : 끝위치 +1
df2[1:2]

    a   b   c   d
1  14  15  16  17

In [147]:
# a행의 A열 값 수정
df.loc['a','A']

10

In [148]:
df.loc['a','A']=50

In [149]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [151]:
# a행의 모든 열 반환
df.loc['a'] # 시리즈로 반환

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [156]:
df.loc[['a']] #데이터프레임으로 반환

    A   B   C   D
a  50  11  12  13

In [157]:
df.loc['a',:] #시리즈로 반환

A    50
B    11
C    12
D    13
Name: a, dtype: int32

a행의 B,C 열 반환

In [159]:
# 시리즈로 반환 - 열에 해당하는 인덱싱을 슬라이싱 처리함
df.loc['a' ,'B':'C']

B    11
C    12
Name: a, dtype: int32

b행부터 모든 행의 A열을 반환하시오

In [160]:
df.loc['b':,'A'] # 시리즈 형태 반환

b    14
c    18
Name: A, dtype: int32

a,b행의 B,D 열을 데이터 프레임으로 반환하시오

In [179]:
df.loc[['a','b'],['B','D']]
df.loc['a':'b',['B','D']]

    B   D
a  11  13
b  15  17

    B   D
a  11  13
b  15  17

a,c 행의 B,D열 출력

In [181]:
df.loc[['a','c'],['B','D']]

    B   D
a  11  13
c  19  21

## iloc 인덱서
- 정수 인덱스로 받음
- 위치 정수값은 0부터 시작
- 데이터프레임.iloc[행,열]

In [182]:
# 0행 1열
df.iloc[0,1]

11

In [185]:
# 0행 1열 : df 형태로 반환-슬라이싱 사용 
df.iloc[0:2,1:2]

    B
a  11
b  15

In [186]:
# 0행 1열 : 시리즈 형태로 반환-슬라이싱, 위치값 사용
df.iloc[0:2,1]

a    11
b    15
Name: B, dtype: int32

In [189]:
# 0행의 2번째 열부터 끝열까지 반환
df.iloc[0,2:]

C    12
D    13
Name: a, dtype: int32

In [190]:
# 0행의 끝에서 두번째 열 이후까지 반환
df.iloc[0,-1:]

D    13
Name: a, dtype: int32

- iloc[행위치,열위치]->원소값 반환
- iloc[행위치1:행위치2,열위치1:열위치2]-> df 반환
- iloc[행위치,열위치1:열위치2]-> 시리즈 반환
- iloc[행위치1:행위치2,열위치]-> 시리즈 반환

**연습문제**
25,50 범위의 숫자를 생성 후 5행 5열로 배치 -> 여러가지 인덱싱 해보기

In [197]:
df = pd.DataFrame(np.arange(25,50).reshape(5,5) , columns = 'A B C D E'.split() , index = 'a b c d e'.split())
df

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [211]:
df.loc['a']
df.loc['a','B']
df.loc[df['A']>40]
df.loc['a':'c','D']
df.loc['a','B':'E']
df.loc['b':,'D':]
df.loc[['a','c'],['C']]
df.iloc[0: , 3:]

A    25
B    26
C    27
D    28
E    29
Name: a, dtype: int32

26

    A   B   C   D   E
e  45  46  47  48  49

a    28
b    33
c    38
Name: D, dtype: int32

B    26
C    27
D    28
E    29
Name: a, dtype: int32

    D   E
b  33  34
c  38  39
d  43  44
e  48  49

    C
a  27
c  37

    D   E
a  28  29
b  33  34
c  38  39
d  43  44
e  48  49

In [221]:
df
# A열 추출
df['A']

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int32

In [222]:
# 0행부터 2행까지 추출
df.iloc[0:3]

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

In [223]:
# 1행의 3,4열 추출
df.iloc[[1],[3,4]]

    D   E
b  33  34

In [224]:
#a행에서 c행까지 중 B열과 D열 추출
df.loc['a':'c'][['B','D']]

    B   D
a  26  28
b  31  33
c  36  38